app/views/tweeets/_profile.html.erb

						<p class="heading">Tweeets</p>
						<p class="title is-6"><%= current_user.tweeets.count %></p>
---
SELECT COUNT(*) FROM `tweeets` WHERE `tweeets`.`user_id` = 1