app/controllers/tweeets_controller.rb

  def index
    @tweeets = Tweeet.all
---
SELECT `tweeets`.* FROM `tweeets`

  def create
    @tweeet = current_user.tweeets.build(tweeet_params)

    respond_to do |format|
      if @tweeet.save
---
INSERT INTO `tweeets` (`tweeet`, `created_at`, `updated_at`) VALUES ('hi tweeet', '2018-07-15 06:14:32', '2018-07-15 06:14:32')

  def destroy
    @tweeet.destroy
---
DELETE FROM `tweeets` WHERE `tweeets`.`id` = 2

    def set_tweeet
      @tweeet = Tweeet.find(params[:id])
---
SELECT  `tweeets`.* FROM `tweeets` WHERE `tweeets`.`id` = 2 LIMIT 1